---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.Spiral
enum: Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType
source: html/555907d2-578b-026a-347c-8900bcf538d8.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArcType.Spiral

A helical bar. The extent of the helix is determined
 by the Rebar properties Height and Pitch.